s_1 = 'раздвинув басом ветра вой:'
k = s_1.replace('ветра', 'ваш')
print(k)

s_2 = 'ИЗ УЛИЦЫ В УЛИЦУ'
w = s_2[9]
print(w)

s_3 = 'а с запада падает красный снег'
v = s_3[2:4]
print(v)

s_4 = 'как святыню, на руках понесут'
h = 'хочет' in s_4
print(h)

s_5 = 'Морей неведомых далеким пляжем'
r = s_5.split(' ')
print(r)

s_6 = 'плыла, изгибаясь, дверями влекома;'
n = s_6.replace('плыла,', 'глаза.')
print(n)

s_7 = 'Ты зеленые весны идешь насиловать!'
q = s_7[14]
print(q)

s_8 = 'Дай исцелую твою лысеющую голову'
g = s_8.split(' ')
print(g[3])
